#include<iostream>
#include<vector>
using namespace std;
//（1）对于一阶齐次递推关系，如f(n) = af(n - 1)，假定序列从f(0)开始，且f(0) = b，可以直接递推求解，即：
//f(n) = af(n - 1) = a2f(n - 2) = … = anf(0) = anb
//可以看出f(n) = anb是递推式的解。
//（2）对于二阶齐次递推关系，如f(n) = a1f(n - 1) + a2f(n - 2)，假定序列从f(0)开始，且f(0) = b1，f(1) = b2。
//其特征方程为x2 - a1x - a2 = 0，令这个二次方式的根是r1和r2，可以求解递推式的解是：
//f(n) = c1r　 + c2r 　	当r1≠r2
//f(n) = c1rn + c2nrn 		当r1 = r2 = r
//代入f(0) = b1，f(1) = b2求出c1和c2。
//
//
//分析求解Fibonacci数列的递归算法的时间复杂度
//对于求Fibonacci数列的递归算法，有以下递归关系式f(n)：
//f(n) = 1			当n = 1或2时
//f(n) = f(n - 1) + f(n - 2) + 1	当n > 2时
//为了简化解，可以引入额外项f(0) = 0。其特征方程是x2 - x - 1 = 0，求得根为：
//chap2 ppt 90页
//内容实在太多且平时基本不用，建议留到期末再看


